city = {0: 'Пермь', 1: 'Березники', 2: 'Киров', 3: 'Екатеринбург', 4: 'Ижевск', 5: 'Казань', 6: 'Уфа'}
n = len(city)
w = [
    [0, 187, 492, 362, 281, 0, 475], # Пермь
    [187, 0, 610, 545, 0, 0, 0],     # Березники
    [492, 610, 0, 0, 419, 395, 0],   # Киров
    [362, 545, 0, 0, 0, 0, 520],     # Екатеринбург
    [281, 0, 419, 0, 0, 385, 343],   # Ижевск
    [0, 0, 395, 0, 385, 0, 525],     # Казань
    [475, 0, 0, 520, 343, 525, 0]    # Уфа
]

active = [True] * n # Просмотренные 
r = w[0]            # Берем все ребра от первой вершины (Пермь)
p = [0] * n         # 

active[0] = False

